[X2DownloadableContentInfo_WOTCDisposableLaunchers]
DRL_WeaponCategory = "一次性发射器"
DRL_Requires_Two_Utility_Slots="一次性发射器需占用两格通用插槽"

[IRI_DRL_CV X2DisposableLauncherTemplate]
FriendlyName="火箭推进榴弹"
FriendlyNamePlural="火箭推进榴弹"
ThrownAbilityName="发射火箭推进榴弹"
ThrownAbilityHelpText="发射火箭推进榴弹。此发会散射。"
BriefSummary="我们设法从原本 XCOM 计划残存的一个弹药库中取得这些一次性火箭推进榴弹的大量存货。它们对装甲目标和一群敌人非常有效，但使用起来很笨拙。"
TacticalText="我们设法从原本 XCOM 计划残存的一个弹药库中取得这些一次性火箭推进榴弹的大量存货。它们对装甲目标和一群敌人非常有效，但使用起来很笨拙。 <br/><Bullet/> 与榴弹不同，火箭弹会散射并可能错过目标。 如果在士兵仅剩一个行动点或从遥远距离发射火箭，则散射结果会更糟。 \n<Bullet/> 携带火箭推进榴弹 会导致行动不便，直到被发射完为止。 \n<Bullet/> 重装甲使用者不会受到行动上的损失。"

[IRI_DRL_MG X2DisposableLauncherTemplate]
FriendlyName="电磁线圈加速榴弹"
FriendlyNamePlural="电磁线圈加速榴弹"
ThrownAbilityName="发射电磁线圈加速榴弹"
ThrownAbilityHelpText="发射电磁线圈加速榴弹。此发会散射。"
BriefSummary="电磁线圈加速榴弹使用超频电磁线圈迅速加速改装的外星榴弹，并以超音速发射。不幸的是，如果没有笨重的配重和冷却装置，在射击过程中线圈衬里总是会炸掉，这使发射器不适合重复使用。"
TacticalText="电磁线圈加速榴弹使用超频电磁线圈迅速加速改装的外星榴弹，并以超音速发射。不幸的是，如果没有笨重的配重和冷却装置，在射击过程中线圈衬里总是会炸掉，这使发射器不适合重复使用。 <br/><Bullet/> 与榴弹不同，火箭弹会散射并可能错过目标。如果在士兵仅剩一个行动点或从遥远距离发射火箭，则散射结果会更糟。 \n<Bullet/> 携带电磁线圈加速榴弹 会导致行动不便，直到被发射完为止。 \n<Bullet/> 重装甲使用者不受机动性惩罚。"

[IRI_DRL_BM X2DisposableLauncherTemplate]
FriendlyName="二元聚变榴弹"
FriendlyNamePlural="二元聚变榴弹"
ThrownAbilityName="发射二元聚变榴弹"
ThrownAbilityHelpText="发射二元聚变榴弹。此发会散射。"
BriefSummary="二元聚变榴弹使用常规炸药炸毁超铀核心，使其具有巨大的爆炸潜力。二元聚变榴弹使用冷凝空气使核心过冷，以延迟链反应。然后通过无接触引力场立即发射核心。"
TacticalText="二元聚变榴弹使用常规炸药炸毁超铀核心，使其具有巨大的爆炸潜力。二元聚变榴弹使用冷凝空气使核心过冷，以延迟链反应。然后通过无接触引力场立即发射核心。 <br/><Bullet/> 与榴弹不同，火箭弹会散射并可能错过目标。如果在士兵仅剩一个行动点或从遥远距离发射火箭，则散射结果会更糟。 \n<Bullet/> 携带二元聚变榴弹会导致行动不便，直到被发射完为止。 \n<Bullet/> 重装甲使用者不受机动性惩罚。"

[XComGameState_Item_DRL]
strDetectionModifier = "检测半径增加"

[DRL_MCM_Screen]
ModName="一次性发射器"
PageTitle="一次性火箭发射器 4.0"
GroupHeader1="常规设置"
GroupHeader2="允许的装备栏位"

DRL_STAT_PENALTIES_ENABLED_Label = "启用一次性火箭发射器属性惩罚"
DRL_STAT_PENALTIES_ENABLED_Tip = "若启用，士兵携带一次性火箭发射器将受到属性惩罚。默认情况下，只有在士兵将一次性火箭发射器装备在实用栏位时才会施加属性惩罚。可在本模组配置文件中重新配置惩罚属性。"

DRL_STAT_PENALTIES_APPLIED_TO_HEAVY_ARMOR_Label = "一次性火箭发射器属性惩罚适用于重型护甲"
DRL_STAT_PENALTIES_APPLIED_TO_HEAVY_ARMOR_Tip = "若启用，士兵即使穿着重型护甲（如E.X.O.或W.A.R.套装），携带一次性火箭发射器时仍会受到属性惩罚。"

UTILITY_DRL_OCCUPIES_TWO_SLOTS_Label = "实用栏位的一次性火箭发射器占用两个栏位"
UTILITY_DRL_OCCUPIES_TWO_SLOTS_Tip = "若启用，在实用栏位装备一次性火箭发射器将移除士兵的一个实用栏位，且士兵只有在至少拥有两个可用实用栏位时，才能在实用栏位装备一次性火箭发射器。"

UTILITY_DRL_MUTUALLY_EXCLUSIVE_WITH_GRENADES_Label = "实用栏位的一次性火箭发射器与手雷互斥"
UTILITY_DRL_MUTUALLY_EXCLUSIVE_WITH_GRENADES_Tip = "若启用，士兵若在实用栏位装备了进攻性手雷，则无法在同一时间在另一个实用栏位装备一次性火箭发射器，反之亦然。"
